pandas에서 DataFrame의 행과 열을 추가 삭제하는 방법.

In [1]:
import pandas as pd

In [5]:
people = {
    "first" : ['Gildong', 'Chunghyang', 'Mongryoung'],
    "last" : ['Hong', 'Sung', 'Lee'],
    "email" : ['gdhong@gmail.com', 'chsung@gmail.com', 'mrlee@gmail.com']
}
df = pd.DataFrame(people)

In [6]:
df

        first  last             email
0     Gildong  Hong  gdhong@gmail.com
1  Chunghyang  Sung  chsung@gmail.com
2  Mongryoung   Lee   mrlee@gmail.com

In [8]:
df['first'] + ' ' + df['last']

0       Gildong Hong
1    Chunghyang Sung
2     Mongryoung Lee
dtype: object

first 칼럼과 last 칼럼의 값을 합치고 그 결과를 추가되는 full_name 칼럼에 저장하자.

In [9]:
df['fullname'] = df['first'] + ' ' + df['last']

In [10]:
df

        first  last             email         fullname
0     Gildong  Hong  gdhong@gmail.com     Gildong Hong
1  Chunghyang  Sung  chsung@gmail.com  Chunghyang Sung
2  Mongryoung   Lee   mrlee@gmail.com   Mongryoung Lee

In [11]:
df.drop(columns = ['first', 'last'])

              email         fullname
0  gdhong@gmail.com     Gildong Hong
1  chsung@gmail.com  Chunghyang Sung
2   mrlee@gmail.com   Mongryoung Lee

결과에 반영이 되지 않아 inplace해야함

In [12]:
df.drop(columns = ['first', 'last'], inplace=True)

In [13]:
df

              email         fullname
0  gdhong@gmail.com     Gildong Hong
1  chsung@gmail.com  Chunghyang Sung
2   mrlee@gmail.com   Mongryoung Lee

fullname 칼럼 값을 ' ' 에 따라 나누고 싶을때

In [14]:
df['fullname'].str.split(' ')

0       [Gildong, Hong]
1    [Chunghyang, Sung]
2     [Mongryoung, Lee]
Name: fullname, dtype: object

이렇게 분리된 값을 두개의 다른 칼럼에 할당하고자 한다면 expand인자를 사용한다.

In [15]:
df['fullname'].str.split(' ', expand=True)

            0     1
0     Gildong  Hong
1  Chunghyang  Sung
2  Mongryoung   Lee

In [16]:
df[['first', 'last']] = df['fullname'].str.split(' ', expand=True)

In [17]:
df

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
2   mrlee@gmail.com   Mongryoung Lee  Mongryoung   Lee

행을 추가 삭제하는 방법

In [18]:
df.append({'first' : 'chanho', 'last': 'Park', 'email':'chpark@gmail.com'}, ignore_index=True)

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
2   mrlee@gmail.com   Mongryoung Lee  Mongryoung   Lee
3  chpark@gmail.com              NaN      chanho  Park

In [19]:
df = df.append({'first' : 'chanho', 'last': 'Park', 'email':'chpark@gmail.com'}, ignore_index=True)

In [20]:
df

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
2   mrlee@gmail.com   Mongryoung Lee  Mongryoung   Lee
3  chpark@gmail.com              NaN      chanho  Park

In [23]:
people = {
    'first' : ['Jisung', 'Youngpyo'],
    'last' : ['Park', 'Lee'],
    'email' : ['jspark@gmail.com', 'yplee@gmail.com']
}

In [24]:
df2 = pd.DataFrame(people)

In [25]:
df2

      first  last             email
0    Jisung  Park  jspark@gmail.com
1  Youngpyo   Lee   yplee@gmail.com

In [26]:
df.append(df2)

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
2   mrlee@gmail.com   Mongryoung Lee  Mongryoung   Lee
3  chpark@gmail.com              NaN      chanho  Park
0  jspark@gmail.com              NaN      Jisung  Park
1   yplee@gmail.com              NaN    Youngpyo   Lee

In [29]:
df = df.append(df2, ignore_index=True)

행을 삭제해보자.  
칼럼을 삭제하는 것과 유사하다. 칼럼을 삭제할 때와 달리 삭제하고자 하는 행의 인덱스를 
전달하면된다.

In [32]:
df.drop(index=3, inplace=True)

In [33]:
df

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
2   mrlee@gmail.com   Mongryoung Lee  Mongryoung   Lee
4  jspark@gmail.com              NaN      Jisung  Park
5   yplee@gmail.com              NaN    Youngpyo   Lee

In [34]:
df['last']== 'Lee'

0    False
1    False
2     True
4    False
5     True
Name: last, dtype: bool

In [38]:
df[df['last'] == 'Lee'].index

Int64Index([2, 5], dtype='int64')

In [39]:
df.drop(df[df['last'] == 'Lee'].index)

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
4  jspark@gmail.com              NaN      Jisung  Park

In [40]:
filt = df[df['last'] == 'Lee'].index

In [42]:
df.drop(index = filt)

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
4  jspark@gmail.com              NaN      Jisung  Park

In [43]:
df

              email         fullname       first  last
0  gdhong@gmail.com     Gildong Hong     Gildong  Hong
1  chsung@gmail.com  Chunghyang Sung  Chunghyang  Sung
2   mrlee@gmail.com   Mongryoung Lee  Mongryoung   Lee
4  jspark@gmail.com              NaN      Jisung  Park
5   yplee@gmail.com              NaN    Youngpyo   Lee